Revit 2024 API
BuiltInFailures.CurtainWallFailures.NoPanelsLoaded Property
 No Curtain Panel Families loaded. Can't make arced Curtain Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoPanelsLoaded { get; }
Visual Basic
Public Shared ReadOnly Property NoPanelsLoaded As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoPanelsLoaded {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace